In [1]:
import pandas as pd

Introduction to Pandas DataFrame and it's creation

In [2]:
data = {"Name":["Anurag","Arinjai","Arjav","Abufroo"],
        "Age":[17,19,18,20],
        "State":["Rajasthan","MP","UK","Manipur"]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

      Name  Age      State
0   Anurag   17  Rajasthan
1  Arinjai   19         MP
2    Arjav   18         UK
3  Abufroo   20    Manipur